<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"b492dad6c46360a4601256a9dbd62ff89cb901e40180a6a6e904c89d55b4e41e","plan_job_ref":"Job Terraform plan (OIDC) #29 at https://github.com/hackforla/incubator/actions/runs/14456522395","plan_out_hash":"e1ffbf5a1cec7c3e3be18d620f9236455af96e310f0cf3414577426469f493f1","plan_hash":"ca2ff2231087586922e561117b08fa616c8b2118962f6328b7184173a21f7ab9","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan in __terraform__
With backend config files: `terraform/prod.backend.tfvars`
<details>
<summary>Plan: 2 to add, 5 to change, 2 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.civic-tech-jobs.module.civic_tech_jobs_fullstack_stage_dns_entry.aws_route53_record.www must be replaced
-/+ resource "aws_route53_record" "www" {
+       allow_overwrite                  = (known after apply)
!~      fqdn                             = "civictechjobs-stage.vrms.io" -> (known after apply)
!~      id                               = "**********************************************" -> (known after apply)
-       multivalue_answer_routing_policy = false -> null
!~      name                             = "civictechjobs-stage" -> "stage" # forces replacement
!~      zone_id                          = "Z0420800PGQ9JP6DM9EX" -> "Z06949943QJY32WRKG577" # forces replacement
#        (5 unchanged attributes hidden)
    }

  # module.civic-tech-jobs.module.civic_tech_jobs_fullstack_stage_service.aws_ecs_service.fargate[0] will be updated in-place
!~  resource "aws_ecs_service" "fargate" {
        id                                 = "arn:aws:ecs:us-west-2:035866691871:service/incubator-prod/civic-tech-jobs-fs-stage"
        name                               = "civic-tech-jobs-fs-stage"
        tags                               = {}
!~      task_definition                    = "arn:aws:ecs:us-west-2:035866691871:task-definition/civic-tech-jobs-fs-stage:3" -> (known after apply)
#        (16 unchanged attributes hidden)

#        (4 unchanged blocks hidden)
    }

  # module.civic-tech-jobs.module.civic_tech_jobs_fullstack_stage_service.aws_ecs_task_definition.task must be replaced
-/+ resource "aws_ecs_task_definition" "task" {
!~      arn                      = "arn:aws:ecs:us-west-2:035866691871:task-definition/civic-tech-jobs-fs-stage:3" -> (known after apply)
!~      arn_without_revision     = "arn:aws:ecs:us-west-2:035866691871:task-definition/civic-tech-jobs-fs-stage" -> (known after apply)
!~      container_definitions    = (sensitive value) # forces replacement
!~      enable_fault_injection   = false -> (known after apply)
!~      id                       = "************************" -> (known after apply)
!~      revision                 = 3 -> (known after apply)
-       tags                     = {} -> null
!~      tags_all                 = {} -> (known after apply)
#        (11 unchanged attributes hidden)
    }

  # module.civic-tech-jobs.module.civic_tech_jobs_fullstack_stage_service.aws_lb_listener_rule.static will be updated in-place
!~  resource "aws_lb_listener_rule" "static" {
        id           = "arn:aws:elasticloadbalancing:us-west-2:035866691871:listener-rule/app/incubator-prod-lb/7451adf77133ef36/390a225766a4daf3/8b944647d0d45e1e"
        tags         = {}
#        (4 unchanged attributes hidden)

-       condition {
-           host_header {
-               values = [
-                   "civictechjobs-stage.vrms.io",
                ] -> null
            }
        }
+       condition {
+           host_header {
+               values = [
+                   "stage.civictechjobs.org",
                ]
            }
        }

#        (2 unchanged blocks hidden)
    }

  # module.people-depot.module.dev_database.postgresql_grant.user will be updated in-place
!~  resource "postgresql_grant" "user" {
        id                = "people-depot_backend_dev_user_people-depot_backend_dev_public_table"
!~      privileges        = [
+           "DELETE",
+           "INSERT",
+           "SELECT",
+           "UPDATE",
        ]
#        (5 unchanged attributes hidden)
    }

  # module.people-depot.module.dev_database.postgresql_grant.viewer will be updated in-place
!~  resource "postgresql_grant" "viewer" {
        id                = "people-depot_backend_dev_viewer_people-depot_backend_dev_public_table"
!~      privileges        = [
+           "SELECT",
        ]
#        (5 unchanged attributes hidden)
    }

  # module.vrms.module.backend_dev_service.aws_ecs_service.fargate[0] will be updated in-place
!~  resource "aws_ecs_service" "fargate" {
        id                                 = "arn:aws:ecs:us-west-2:035866691871:service/incubator-prod/vrms-backend-dev"
        name                               = "vrms-backend-dev"
        tags                               = {}
!~      task_definition                    = "arn:aws:ecs:us-west-2:035866691871:task-definition/vrms-backend-dev:41" -> "arn:aws:ecs:us-west-2:035866691871:task-definition/vrms-backend-dev:40"
#        (16 unchanged attributes hidden)

#        (4 unchanged blocks hidden)
    }

Plan: 2 to add, 5 to change, 2 to destroy.
```
</details>

:memo: Plan generated in [Terraform plan (OIDC) #29](https://github.com/hackforla/incubator/actions/runs/14456522395)